configuration/src/Catalogs/УчетныеЗаписиЭлектроннойПочты/УчетныеЗаписиЭлектроннойПочты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УчетныеЗаписиЭлектроннойПочты</name>
  <attributes>
    <name>АдресСервераIMAP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресЭлектроннойПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОжидания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователя</name>
    <comment>Имя отправителя</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьSSLIMAP</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьБезопасныйВходНаСерверВходящейПочты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьБезопасныйВходНаСерверИсходящейПочты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДляОтправки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДляПолучения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьЗащищенноеСоединениеДляИсходящейПочты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПарольSMTP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательSMTP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПортIMAP</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПортСервераИсходящейПочты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерверИсходящейПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

configuration/src/Catalogs/УчетныеЗаписиЭлектроннойПочты/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает заполненный почтовый профиль для приема сообщений
// 
// Возвращаемое значение:
//   - ИнтернетПочтовыйПрофиль
//
Функция СвойстваСлужебногоЯщикаДляПолученияПисем() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ПрофильЗаполнен", Истина);
	Результат.Вставить("ПочтовыйПрофиль", Новый ИнтернетПочтовыйПрофиль);
	Результат.Вставить("Отправитель", Новый Структура("Имя, Адрес",  "", ""));
		
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	УчетныеЗаписиЭлектроннойПочты.АдресЭлектроннойПочты КАК АдресОтправителя,
	|	УчетныеЗаписиЭлектроннойПочты.АдресСервераIMAP КАК АдресСервераIMAP,
	|	УчетныеЗаписиЭлектроннойПочты.ВремяОжидания КАК Таймаут,
	|	УчетныеЗаписиЭлектроннойПочты.ИспользоватьSSLIMAP КАК ИспользоватьSSLIMAP,
	|	УчетныеЗаписиЭлектроннойПочты.ИмяПользователя КАК ИмяОтправителя,
	|	УчетныеЗаписиЭлектроннойПочты.ПарольSMTP КАК Пароль,
	|	УчетныеЗаписиЭлектроннойПочты.ПользовательSMTP КАК Пользователь,
	|	УчетныеЗаписиЭлектроннойПочты.ПарольSMTP КАК ПарольIMAP,
	|	УчетныеЗаписиЭлектроннойПочты.ПользовательSMTP КАК ПользовательIMAP,
	|	УчетныеЗаписиЭлектроннойПочты.ПортIMAP КАК ПортIMAP
	|ИЗ
	|	Справочник.УчетныеЗаписиЭлектроннойПочты КАК УчетныеЗаписиЭлектроннойПочты
	|ГДЕ
	|	УчетныеЗаписиЭлектроннойПочты.ИспользоватьДляПолучения";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		// Заполняем профиль почты
		ЗаполнитьЗначенияСвойств(Результат.ПочтовыйПрофиль, Выборка);
		
		Результат.Отправитель.Имя = Выборка.ИмяОтправителя;
		Результат.Отправитель.Адрес = Выборка.АдресОтправителя;
	Иначе
		Результат.ПрофильЗаполнен = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает заполненный почтовый профиль для отправки сообщений
// 
// Возвращаемое значение:
//   - ИнтернетПочтовыйПрофиль
//
Функция СвойстваСлужебногоЯщикаДляОтправкиПисем () Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ПрофильЗаполнен", Истина);
	Результат.Вставить("ПочтовыйПрофиль", Новый ИнтернетПочтовыйПрофиль);
	Результат.Вставить("Отправитель", Новый Структура("Имя, Адрес",  "", ""));
		
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	УчетныеЗаписиЭлектроннойПочты.АдресЭлектроннойПочты КАК АдресОтправителя,
	|	УчетныеЗаписиЭлектроннойПочты.ВремяОжидания КАК Таймаут,
	|	УчетныеЗаписиЭлектроннойПочты.ИспользоватьЗащищенноеСоединениеДляИсходящейПочты КАК ИспользоватьSSLSMTP,
	|	УчетныеЗаписиЭлектроннойПочты.ИмяПользователя КАК ИмяОтправителя,
	|	УчетныеЗаписиЭлектроннойПочты.ПарольSMTP КАК Пароль,
	|	УчетныеЗаписиЭлектроннойПочты.ПользовательSMTP КАК Пользователь,
	|	УчетныеЗаписиЭлектроннойПочты.ПарольSMTP КАК ПарольSMTP,
	|	УчетныеЗаписиЭлектроннойПочты.ПользовательSMTP КАК ПользовательSMTP,
	|	УчетныеЗаписиЭлектроннойПочты.ПортСервераИсходящейПочты КАК ПортSMTP,
	|	УчетныеЗаписиЭлектроннойПочты.СерверИсходящейПочты КАК АдресСервераSMTP
	|ИЗ
	|	Справочник.УчетныеЗаписиЭлектроннойПочты КАК УчетныеЗаписиЭлектроннойПочты
	|ГДЕ
	|	УчетныеЗаписиЭлектроннойПочты.ИспользоватьДляОтправки";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		// Заполняем профиль почты
		ЗаполнитьЗначенияСвойств(Результат.ПочтовыйПрофиль, Выборка);	
		
		Результат.Отправитель.Имя = Выборка.ИмяОтправителя;
		Результат.Отправитель.Адрес = Выборка.АдресОтправителя;
	Иначе
		Результат.ПрофильЗаполнен = Ложь;
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

#КонецОбласти
